# Создайте функцию def print_params, которая в своем теле будет распечатывать переданное значение из параметра 2 раза!
def print_param(param):
    print(param, param, sep=', ', end='.\n')

# Вызовите данную функцию несколько раз в том же файле
print_param('да')
print_param('нет')
print_param('привет')
