# Создайте список из 5 машин - ["BMW", "MB", "LADA", "KIA", "HONDA"]
cars = ["BMW", "MB", "LADA", "KIA", "HONDA"]

# Создайте целочисленную переменную cars_count = 0
cars_count = 0

# Создайте цикл for и в цикле распечатайте каждый из автомобилей в строке 'Я езжу на автомабиле марки'
# Напишите в цикле из шага номер 2 увеличение переменной на 10 в каждом шаге цикла (cars_count += 10)
for car in cars:
    print('Я езжу на автомобиле марки', car)
    cars_count += 10

print(cars_count)   # В задании нет, но зачем тогда вообще cars_count?

# Посмотрите на консоль и на ход выполнения программы
# Посмотрел...
